tutorials/multiphase/cavitatingFoam/les/throttle3D/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Set application name
application="cavitatingFoam"

refineMeshByCellSet()
{
   while [ $# -ge 1 ]
   do
      echo "creating cell set for primary zone - $1"
      cp system/topoSetDict.$1 system/topoSetDict
      topoSet > log.topoSet.$1 2>&1

      echo "refining primary zone - $1"
      refineMesh -dict -overwrite > log.refineMesh.$1 2>&1
      shift
   done
}

cp -r 0.org 0

runApplication blockMesh
refineMeshByCellSet 1 2 3

echo "mapping fields from 2D throttle case"
mapFields ../throttle -sourceTime latestTime > log.mapFields 2>&1

runApplication decomposePar
runParallel $application 4
runApplication reconstructPar

# ----------------------------------------------------------------- end-of-file
